uhnp/src/InformationRegisters/ЖурналОбменаСЭТП/ЖурналОбменаСЭТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОбменаСЭТП</name>
  <resources>
    <name>ЭТП</name>
    <type>
      <types>CatalogRef.ЭлектронныеТорговыеПлощадки</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <comment>Транзакция закончилась ошибкой</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ВидТранзакции</name>
    <type>
      <types>EnumRef.ВидыТранзакцийОбменаСЭТП</types>
    </type>
  </resources>
  <resources>
    <name>Завершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОтЭТПК1С</name>
    <comment>Направление обмена</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектОбмена</name>
    <type>
      <types>DefinedType.ОбъектыЦУЗОбменаСЭТП_УХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <comment>Номер записи в пределах отбора по вышестоящим измерениям регистра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЖурналОбменаСЭТП/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	УстановитьОформлениеФормы()
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеФормы()
	Элементы.ГруппаЗапрос.Видимость = ЗначениеЗаполнено(Запись.КлючСообщения);
	Элементы.ГруппаОтвет.Видимость = ЗначениеЗаполнено(Запись.КлючОтвета);
	Элементы.ТекстОшибки.Видимость = Запись.Ошибка;
	Элементы.Ошибка.ЦветТекста = ЦветаСтиля.ЦветШрифтаОшибкиУХ;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекстЗапроса(Команда)
	флИсходящееСообщение = (Команда.Имя = "ОткрытьТекстЗапроса");
	
	Если флИсходящееСообщение Тогда
		ПередаваемыйКлюч = Запись.КлючСообщения;
	Иначе
		ПередаваемыйКлюч = Запись.КлючОтвета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПередаваемыйКлюч) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ИнтеграцияЦУЗсЭТПСерверУХ.ПолучитьСообщениеОбменаПоКлючу(Запись.ЭТП, Запись.ОбъектОбмена, ПередаваемыйКлюч, флИсходящееСообщение);
	
	ОбщегоНазначенияКлиентУХ.ОткрытьФормуРедактированияМногострочногоТекста(
		Неопределено, ТекстСообщения, Неопределено,, НСтр("ru='Текст сообщения в ЕИС'"));
		
КонецПроцедуры
